<?php
include_once "classDB.php";
/*************************************************************************************************
 * **********************************************************************************************
 * 
 *          题库类(classProblemBank) 提供了SQLOJ系统中常用の涉及题库操作の方法
 *          它的实例化表示<一个题库>是一系列题目的集合
 *          
 *          
 * +--+-+-+--+-+-+-+--+函数功能说明+-+-+-+-+-+-+-+-+-+-+-+-+--+-+-+-+-+-+-
 * 
 * 1.__construct($url)                      |   构造函数
 * 2.__destruct()                           |   析构函数
 * 3.
 * 
 * **********************************************************************************************
 ***********************************************************************************************/
class ProblemBank{
    protected $bankID = NULL;               //题库ID
    protected $problemList = NULL;          //题目列表

    //构造函数,当没有题库ID时默认是要创建题库
    public function __construct($bankID = -1) {
        if ($bankID <= 0) {

        }
        else {

        }
    }

    public function __destruct() {
        
    }
}